In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(['1.0','2000',3000])

In [3]:
print(s)

0     1.0
1    2000
2    3000
dtype: object

In [4]:
s1 = pd.to_numeric(s) #We use to_numeric to convert data to numeric or float format

In [5]:
print(s1)

0       1.0
1    2000.0
2    3000.0
dtype: float64

In [6]:
s2 = pd.Series(['1.0','#APPLE', 2000])

In [7]:
pd.to_numeric(s2) #ignore argument

ValueError: Unable to parse string "#APPLE" at position 1

In [8]:
a = pd.to_numeric(s2, errors = 'coerce')
#Coerce is used to convert any unconvertable format into null values

In [9]:
print(a)

0       1.0
1       NaN
2    2000.0
dtype: float64

In [10]:
de = {'training':['DA','ML','DL','AI'], 'hours':[np.nan,np.nan,5,6], 'tools':[np.nan,np.nan,np.nan,4]}

In [11]:
df1 = pd.DataFrame(de)

In [12]:
print(df1)

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0

In [13]:
df1.shape

(4, 3)

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
hours       2 non-null float64
tools       1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [15]:
df1.isnull().sum()

training    0
hours       2
tools       3
dtype: int64

In [16]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0

In [17]:
#handling null values
df1.dropna(axis = 0) #By using dropna we are able to drop entire row which contains the null value

  training  hours  tools
3       AI    6.0    4.0

In [18]:
df1.dropna(axis=1) #by using axis=1 we are able to drop entire column

  training
0       DA
1       ML
2       DL
3       AI

In [19]:
df1.dropna(subset = ['hours'])

  training  hours  tools
2       DL    5.0    NaN
3       AI    6.0    4.0

In [24]:
df1.dropna(subset = ['tools'])

  training  hours  tools
3       AI    6.0    4.0

In [27]:
df1.dropna(thresh =4) #Thresh checks for number of null values in specific column and drops the rows

Empty DataFrame
Columns: [training, hours, tools]
Index: []

### df

In [28]:
#Filling the null values
df1.fillna('Hai')

  training hours tools
0       DA   Hai   Hai
1       ML   Hai   Hai
2       DL     5   Hai
3       AI     6     4

In [29]:
df1.fillna(df1.mean())

  training  hours  tools
0       DA    5.5    4.0
1       ML    5.5    4.0
2       DL    5.0    4.0
3       AI    6.0    4.0

In [30]:
df1.replace(4, 'four')

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN   NaN
2       DL    5.0   NaN
3       AI    6.0  four

In [31]:
df1.replace([5,6], '12#WhEREisMyAssignMent??')

  training                     hours  tools
0       DA                       NaN    NaN
1       ML                       NaN    NaN
2       DL  12#WhEREisMyAssignMent??    NaN
3       AI  12#WhEREisMyAssignMent??    4.0

In [47]:
df1

  training                Assignment                     tools
0       DS                       NaN                       NaN
1       RL                       NaN                       NaN
2       DL  12#WhEREisMyAssignMent??                       NaN
3       AI                         6  12#WhEREisMyAssignMent??

In [32]:
df1.replace([5,6],[222, 442])

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL  222.0    NaN
3       AI  442.0    4.0

In [33]:
df1.iloc[1,2] = '@~_12PaHE'

In [34]:
df1.iloc[2,2] = 'h&!}+1FRe3'

In [35]:
df1

  training  hours       tools
0       DA    NaN         NaN
1       ML    NaN   @~_12PaHE
2       DL    5.0  h&!}+1FRe3
3       AI    6.0           4

In [46]:
df1.replace(regex = True, to_replace = '[^0-9]', value = '')

  training  hours tools
0             NaN   NaN
1             NaN    12
2             5.0    13
3             6.0     4

In [47]:
df1.iloc[:,1:3] = df1.iloc[:,1:3].replace(regex= True, to_replace = '[^0-9]', value = '')

In [53]:
del df1['training']

In [48]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN    12
2       DL    5.0    13
3       AI    6.0     4

In [85]:
cd Downloads

/Users/kanth/Downloads

In [86]:
lend = pd.read_excel('Lending Data.xlsx')

In [87]:
lend

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
0,NaN,NaN,-1,-2,-3,-4,-5,-6,-7.0,-8.0,NaN,-9.0,-10.0,-11
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,NaN,31949.0,138.0,0.28
2,First Citizens Banchares,NC,2,0.187393,0.49083,3914507,117702,$10B-$50B,378394.0,105081.0,NaN,3536113.0,12621.0,.
3,Wintrust Financial Corp.,IL,3,0.168999,0.383561,2842793,136801,$10B-$50B,800526.0,126455.0,NaN,2042267.0,10346.0,0
4,Zions Bancorp,UT,4,0.117973,0.260577,6231770,52612,>$50B,526206.0,32973.0,NaN,5705564.0,19639.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,0.0,0.0,NaN,0.0,0.0,.
94,"*The bank was formerly known as GE Money Bank,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
95,1 TA = total domestic assets held by the lende...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
96,"Source: U.S. Small Business Administration, Of...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [60]:
#Joining
a = df.append(df1) #To perform row wise joining
print(a.shape)
print(a)

(8, 4)
   Assignment  hours  tools training
0         NaN    NaN    NaN       DA
1         NaN    4.0    NaN       ML
2         NaN    5.0    NaN       DL
3         NaN    6.0    4.0       AI
0         NaN    NaN    NaN       DS
1         NaN    NaN    NaN       RL
2         5.0    NaN    NaN       DL
3         6.0    NaN    4.0       AI

/Users/kanth/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

In [62]:
pd.concat([df, df1], axis = 1)

  training  hours  tools training  Assignment  tools
0       DA    NaN    NaN       DS         NaN    NaN
1       ML    4.0    NaN       RL         NaN    NaN
2       DL    5.0    NaN       DL         5.0    NaN
3       AI    6.0    4.0       AI         6.0    4.0

In [88]:
e

  Tools  fee training
0     2    3       DS
1     4   30       ML
2     2  NaN       DL
3     4    4       DS
0   NaN  NaN       DS
1   NaN  NaN       ML
2     2  NaN       DL
3     4  NaN       DS

In [95]:
df

  training Tools  fee
0       DS     2    3
1       ML     4   30
2       DL     2  NaN
3       DS     4    4

In [96]:
df1

  training  hours
0       DS    NaN
1       ML    NaN
2       DL    2.0
3       AI    4.0

In [67]:
pd.merge(df,df1, how = 'right', on = 'training')

  training  hours  tools_x  Assignment  tools_y
0       DL    5.0      NaN         5.0      NaN
1       AI    6.0      4.0         6.0      4.0
2       DS    NaN      NaN         NaN      NaN
3       RL    NaN      NaN         NaN      NaN

In [38]:
pd.merge(df,df1, how = 'right', on = 'training')

  training  Assignment_x  tools_x  Assignment_y tools_y
0       DS           NaN      NaN           NaN     NaN
1       RL           NaN      NaN           NaN     123
2       DL           5.0      NaN           5.0     342
3       AI           6.0      4.0           6.0       4

In [39]:
pd.merge(df,df1, how = 'inner', on = 'training')

  training  Assignment_x  tools_x  Assignment_y tools_y
0       DS           NaN      NaN           NaN     NaN
1       RL           NaN      NaN           NaN     123
2       DL           5.0      NaN           5.0     342
3       AI           6.0      4.0           6.0       4

In [2]:
s = pd.Series([1,2,3,2,3,4])

In [3]:
s.replace(2, method ='bfill')

0    1
1    3
2    3
3    3
4    3
5    4
dtype: int64

In [4]:
s.replace(2, method ='ffill')

0    1
1    1
2    3
3    3
4    3
5    4
dtype: int64

In [71]:
df1.drop(df1.columns[2], axis = 1)

  training  Assignment
0       DS         NaN
1       RL         NaN
2       DL         5.0
3       AI         6.0

In [72]:
df1.astype(int)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [73]:
a = pd.melt(df1)

In [74]:
pd.melt(df1)

      variable value
0     training    DS
1     training    RL
2     training    DL
3     training    AI
4   Assignment   NaN
5   Assignment   NaN
6   Assignment     5
7   Assignment     6
8        tools   NaN
9        tools   NaN
10       tools   NaN
11       tools     4

In [77]:
df[df.training.isin(df1.training)]

  training  hours  tools
2       DL    5.0    NaN
3       AI    6.0    4.0

In [75]:
df.training.isin(df1.training)

0    False
1    False
2     True
3     True
Name: training, dtype: bool

In [61]:
df1

  training  hours  tools
0       DS    NaN    NaN
1       ML    NaN    NaN
2       DL    2.0    NaN
3       AI    4.0    4.0

In [56]:
a = df.training.isin(df1.training)

In [78]:
df1

  training  Assignment  tools
0       DS         NaN    NaN
1       RL         NaN    NaN
2       DL         5.0    NaN
3       AI         6.0    4.0

In [79]:
df[df['hours'] < 6] # Rows where the column col is greater than 0.5

  training  hours  tools
1       ML    4.0    NaN
2       DL    5.0    NaN

In [82]:

df.sort_values(['hours','tools'],ascending=[True,False]) # Sort values by col1 in ascending order then col2 in descending order

  training  hours  tools
1       ML    4.0    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
0       DA    NaN    NaN

In [ ]:
df.sort_values(col2,ascending=False) # Sort values by col2 in descending order

In [ ]:
df[(df[] > 0.5) & (df[col] < 0.7)] # Rows where 0.7 > col > 0.5

In [ ]:
df.sort_values(col1) # Sort values by col1 in ascending order

In [88]:
lend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 14 columns):
Name of Lending Institution    96 non-null object
HQ State                       93 non-null object
Rank                           94 non-null object
TA Ratio1                      94 non-null object
TBL Ratio1                     94 non-null object
Amount ($1,000)                94 non-null object
Number                         94 non-null object
Lender Asset Size              94 non-null object
Amount ($1,000).1              94 non-null float64
Number .1                      94 non-null float64
Unnamed: 10                    0 non-null float64
Amount ($1,000).2              94 non-null float64
Number .2                      94 non-null float64
CC Amount/TA1                  94 non-null object
dtypes: float64(5), object(9)
memory usage: 10.7+ KB

In [89]:
lend.shape

(97, 14)

In [90]:
lend.isnull().sum()

Name of Lending Institution     1
HQ State                        4
Rank                            3
TA Ratio1                       3
TBL Ratio1                      3
Amount ($1,000)                 3
Number                          3
Lender Asset Size               3
Amount ($1,000).1               3
Number .1                       3
Unnamed: 10                    97
Amount ($1,000).2               3
Number .2                       3
CC Amount/TA1                   3
dtype: int64

In [95]:
lend

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,"Amount ($1,000).2",Number .2,CC Amount/TA1
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,31949.0,138.0,0.28
2,First Citizens Banchares,NC,2,0.187393,0.49083,3914507,117702,$10B-$50B,378394.0,105081.0,3536113.0,12621.0,.
3,Wintrust Financial Corp.,IL,3,0.168999,0.383561,2842793,136801,$10B-$50B,800526.0,126455.0,2042267.0,10346.0,0
4,Zions Bancorp,UT,4,0.117973,0.260577,6231770,52612,>$50B,526206.0,32973.0,5705564.0,19639.0,0
5,Synovus Financial Corp.,GA,5,0.162333,0.381387,4227168,22675,$10B-$50B,539666.0,9593.0,3687502.0,13082.0,0.01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
89,USAA Svg. Bank,NV,NR,0,-,0,1,>$10B,0.0,1.0,0.0,0.0,.
90,State Street Corp.,MA,NR,-,-,-,-,>$50B,0.0,0.0,0.0,0.0,0
91,E Trade Bk,VA,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,0.0,0.0,0.0,0.0,.